import sys


'''
풀이 과정 :
주어진 과정은 하노이의 탑과 비슷하나 중간의 돌도 뺄 수 있다는 차이점이 있다.
접근법은 다음과 같다.
f(n) : n개의 돌을 옮기는 최소한의 이동횟수라 하자.
n = 1 일 때, 최소 이동 횟수는 1이다. 즉, f(1) = 1
n = k (n >= 2) 일 때 최소 이동
1) 우선 맨 밑을 제외한 나머지 부분을 두번째 방석으로 옮긴다. 이는 돌을 k - 1번 옮긴다..
(맨 밑의 돌 바로 위의 돌을 하나씩 빼서 옮기면 되기 때문)
2) 맨 밑의 돌을 옮긴다. 이는 돌을 1번 옮긴다.
3) 두번째 방석에 있는 돌을 세번째 방석으로 옮긴다.
   그런데 맨 밑의 돌은 건드릴 수 없기 때문에 그대로 하나씩 다시 옮길 수는 없다.
   한편 이를 방석의 위치만 고스란히 바꾸면 이 돌을 옮기는데 필요한 횟수는 n = k - 1일 때의 돌을 옮기는 경우와 같다.
   이를 이용하면 이때 돌을 옮기는 횟수는 f(k-1)이 됨을 알수 있다.
   즉 f(k) = k + f(k-1) (n >= 2)
위 점화식을 이용해서 풀어내면 f(n)은 다음과 같다.
f(n) = 1 + 2 + 3 + ... + n - 1 + n = n(n+1)/2
'''
n = int(input())
print(n * (n + 1) // 2)
